perf/cases/metar/metar-cache.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      payload:
        path: "../../data/metar_stations.csv"
        order: "random"
        fields: 
          - "station"
      defaults:
        headers:
            cache: "TRUE"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp [1]
      duration: 20
      arrivalRate: 10
      rampTo: 30
    - name: Plain [1]
      duration: 45
      arrivalRate: 30
    - name: Spike [1]
      duration: 30
      arrivalRate: 70
    - name: Plain [2]
      duration: 45
      arrivalRate: 50
    - name: Ramp [2]
      duration: 20
      arrivalRate: 50
      rampTo: 25
    - name: Spike [2]
      duration: 20
      arrivalRate: 150
    - name: Plain [3]
      duration: 30
      arrivalRate: 120
    - name: Spike [3]
      duration: 45
      arrivalRate: 350
    - name: Ramp [Shutdown 1]
      duration: 20
      arrivalRate: 350
      rampTo: 5
    - name: Ramp [Shutdown 2]
      duration: 10
      arrivalRate: 5
      rampTo: 0
    

scenarios:
  - name: METAR [Cache]
    flow:
      - get:
          url: "/metar?station={{ station }}"